In [ ]:
a. Kindly fill the missing values with
1.value
2.Statistical value
3.Filling  method

B) Create pivot table for  position and average salary.
C) Group the data using group by as per gender  and average age.

In [1]:
import pandas as pd
import numpy as np

In [24]:
df = pd.read_excel(r"C:\Users\CHARISHMA\Downloads\ethnic_diversity.xlsx")

In [3]:
df

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,Accountant I,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...
305,"Daniele, Ann",1411071312,Sr. Network Engineer,CT,6033.0,F,Married,US Citizen,Leave of Absence,IT/IS,37619.01,38,White
306,"Lajiri, Jyoti",1108028108,Sr. Network Engineer,MA,2169.0,M,Married,US Citizen,Leave of Absence,IT/IS,27603.00,34,White
307,"Semizoglou, Jeremiah",904013591,Sr. Network Engineer,MA,1545.0,M,Married,US Citizen,Future Start,IT/IS,27587.46,24,Asian
308,"South, Joe",1308060959,Sr. Network Engineer,CT,6278.0,M,Single,US Citizen,Active,IT/IS,12126.53,31,White
309,"Warfield, Sarah",1301052347,Sr. Network Engineer,MA,2453.0,F,Widowed,US Citizen,Active,IT/IS,37257.00,46,Asian

In [ ]:
a. Kindly fill the missing values with
1.value
2.Statistical value
3.Filling  method

In [4]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             3
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### Position

In [25]:
df['Position'].isna().sum()

3

In [26]:
df[df['Position'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
91,"Desimone, Carl",1501072124,NaN,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
95,"Kirill, Alexandra",903013071,NaN,MA,2127.0,F,Married,US Citizen,Voluntarily Terminated,Production,37619.00,44,White
151,"Engdahl, Jean",1007020403,NaN,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [27]:
df['Position'].fillna('Data Scientist',inplace = True)#using value

In [28]:
df['Position'].isna().sum()

0

In [30]:
df['Position'][91]

'Data Scientist'

In [29]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### State

In [31]:
df['State'].isna().sum()

2

In [32]:
df[df['State'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
81,"Liebig, Ketsia",1103024679,Production Manager,NaN,2110.0,F,Married,US Citizen,Active,Production,28520.00,35,White
151,"Engdahl, Jean",1007020403,Data Scientist,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White

In [33]:
df['State'].mode()

0    MA
Name: State, dtype: object

In [34]:
df['State'].mode()[0]

'MA'

In [35]:
df['State'].fillna(df['State'].mode()[0],inplace = True) #using statistical measure (mode)

In [36]:
df['State'].isna().sum()

0

In [37]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [38]:
df['State'][81]

'MA'

### Zip

In [39]:
df['Zip'].isna().sum()

2

In [40]:
df[df['Zip'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
83,"Peterson, Ebonee",1402065355,Production Manager,MA,NaN,F,Married,US Citizen,Voluntarily Terminated,Production,37487.05,27,White
146,"Sutwell, Barbara",1407069061,Production Technician I,MA,NaN,NaN,Single,Eligible NonCitizen,Active,Production,22626.11,45,Asian

In [41]:
df['Zip'].fillna(method='bfill',inplace = True) #bfill

In [42]:
df['Zip'].isna().sum()

0

In [45]:
df['Zip'][83]

2451.0

In [47]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### Gender

In [48]:
df['Gender'].isna().sum()

7

In [49]:
df[df['Gender'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
26,"Martins, Joseph",1209048771,Area Sales Manager,TX,78207.0,NaN,Single,Eligible NonCitizen,Active,Sales,30817.00,45,Black or African American
146,"Sutwell, Barbara",1407069061,Production Technician I,MA,1887.0,NaN,Single,Eligible NonCitizen,Active,Production,22626.11,45,Asian
150,"Cornett, Lisa",1403066069,Production Technician I,MA,2189.0,NaN,Married,US Citizen,Active,Production,33801.00,24,White
166,"Dickinson, Geoff",706006285,Production Technician I,MA,2180.0,NaN,Single,US Citizen,Active,Production,5325.51,23,White
186,"Mckenna, Sandy",909015167,Production Technician I,MA,2184.0,NaN,Married,US Citizen,Active,Production,55226.80,46,Black or African American
202,"Linares, Marilyn",1206042315,Production Technician I,MA,1886.0,NaN,Married,US Citizen,Voluntarily Terminated,Production,35448.62,49,White
216,"Kinsella, Kathleen",710007401,Production Technician I,MA,2170.0,NaN,NaN,US Citizen,Voluntarily Terminated,Production,108304.00,27,White

In [50]:
df['Gender'].fillna(method = 'ffill',inplace = True) #ffill

In [54]:
df['Gender'][146]

'F'

In [51]:
df['Gender'].isna().sum()

0

In [53]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### MaritalDesc

In [55]:
df['MaritalDesc'].isna().sum()

9

In [56]:
df[df['MaritalDesc'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
32,"Terry, Sharlene",1401064637,Area Sales Manager,OR,97756.0,F,NaN,US Citizen,Active,Sales,36485.25,49,Black or African American
48,"Roby, Lori",1407068885,Data Analyst,MA,1886.0,F,NaN,US Citizen,Active,IT/IS,22721.00,23,White
70,"Shepard, Anita",906014183,Network Engineer,MA,1773.0,F,NaN,US Citizen,Active,IT/IS,27588.40,30,White
91,"Desimone, Carl",1501072124,Data Scientist,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
112,"Ngodup, Shari",1403066020,Production Technician I,MA,1810.0,F,NaN,US Citizen,Active,Production,66142.11,27,Asian
134,"Beatrice, Courtney",1403066194,Production Technician I,MA,1915.0,F,NaN,Eligible NonCitizen,Active,Production,NaN,44,White
161,"Stoica, Rick",1106026896,Production Technician I,MA,2301.0,M,NaN,US Citizen,Active,Production,47548.01,34,Asian
189,"Purinton, Janine",1011022926,Production Technician I,MA,2474.0,F,NaN,US Citizen,Voluntarily Terminated,Production,2250.00,27,White
216,"Kinsella, Kathleen",710007401,Production Technician I,MA,2170.0,F,NaN,US Citizen,Voluntarily Terminated,Production,108304.00,27,White

In [57]:
df['MaritalDesc'].fillna('Single',inplace = True)

In [59]:
df['MaritalDesc'][70]

'Single'

In [58]:
df['MaritalDesc'].isna().sum()

0

In [60]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### CitizenDesc

In [61]:
df['CitizenDesc'].isna().sum()

3

In [62]:
df[df['CitizenDesc'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
19,"Villanueva, Noah",1111030503,Area Sales Manager,ME,4063.0,M,Single,NaN,Active,Sales,25521.82,25,Asian
29,"Onque, Jasmine",1501072180,Area Sales Manager,FL,33174.0,F,Single,NaN,Active,Sales,53196.72,38,White
88,"Anderson, Linda",1304055947,Production Technician I,MA,1844.0,F,Single,NaN,Active,Production,49500.00,25,White

In [63]:
df['CitizenDesc'].value_counts()

CitizenDesc
US Citizen             291
Eligible NonCitizen     12
Non-Citizen              4
Name: count, dtype: int64

In [64]:
df['CitizenDesc'].mode()

0    US Citizen
Name: CitizenDesc, dtype: object

In [65]:
df['CitizenDesc'].mode()[0]

'US Citizen'

In [66]:
df['CitizenDesc'].fillna(df['CitizenDesc'].mode()[0],inplace = True)

In [68]:
df['CitizenDesc'][19]

'US Citizen'

In [67]:
df['CitizenDesc'].isna().sum()

0

In [69]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

### Department

In [70]:
df['Department'].isna().sum()

5

In [71]:
df[df['Department'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
30,"Potts, Xana",1102024106,Area Sales Manager,KY,40220.0,F,Married,US Citizen,Active,NaN,28919.00,54,Black or African American
47,"Petrowsky, Thelma",1108027853,Data Analyst,MA,1886.0,F,Married,US Citizen,Active,NaN,58672.00,46,Asian
69,"Morway, Tanya",1001956578,Network Engineer,MA,2048.0,F,Married,US Citizen,Active,NaN,32278.40,27,White
91,"Desimone, Carl",1501072124,Data Scientist,MA,2061.0,M,Single,US Citizen,Active,NaN,15736.71,26,White
190,"Rossetti, Bruno",1405067492,Production Technician I,MA,2155.0,M,Single,US Citizen,Voluntarily Terminated,NaN,NaN,29,White

In [72]:
df['Department'].value_counts()

Department
Production              206
IT/IS                    48
Sales                    30
Admin Offices            10
Software Engineering     10
Executive Office          1
Name: count, dtype: int64

In [73]:
df['Department'].fillna('Executive office',inplace = True)

In [75]:
df['Department'][91]

'Executive office'

In [74]:
df['Department'].isna().sum()

0

In [76]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             0
State                0
Zip                  0
Gender               0
MaritalDesc          0
CitizenDesc          0
EmploymentStatus     0
Department           0
Salaries            12
age                  0
Race                 9
dtype: int64

In [77]:
df['Salaries'].isna().sum()

12

In [78]:
df[df['Salaries'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
21,"Costa, Latia",1409070567,Area Sales Manager,CA,90007.0,F,Single,US Citizen,Active,Sales,NaN,50,White
35,"Westinghouse, Matthew",1009919990,BI Developer,MA,2134.0,M,Married,US Citizen,Active,IT/IS,NaN,26,White
53,"Bramante, Elisa",1006020066,Director of Operations,MA,2030.0,F,Single,US Citizen,Active,Production,NaN,51,Black or African American
65,"Cisco, Anthony",1102024173,IT Support,MA,2135.0,M,Married,US Citizen,Active,IT/IS,NaN,39,White
86,"Sullivan, Kissy",1405067298,Production Manager,MA,1776.0,F,Married,US Citizen,Active,Production,NaN,46,Black or African American
101,"Theamstern, Sophia",1404066739,Production Technician I,MA,2066.0,F,Single,US Citizen,Voluntarily Terminated,Production,NaN,40,White
120,"Cockel, James",1599991009,Production Technician I,MA,2452.0,M,Single,US Citizen,Active,Production,NaN,40,White
134,"Beatrice, Courtney",1403066194,Production Technician I,MA,1915.0,F,Single,Eligible NonCitizen,Active,Production,NaN,44,White
148,"Barone, Francesco A",1101023679,Production Technician I,MA,1810.0,M,Single,US Citizen,Active,Production,NaN,25,Two or more races
169,"Heitzman, Anthony",1002017900,Production Technician I,MA,2149.0,M,Single,US Citizen,Active,Production,NaN,46,White
190,"Rossetti, Bruno",1405067492,Production Technician I,MA,2155.0,M,Single,US Citizen,Voluntarily Terminated,Executive office,NaN,29,White

In [79]:
df['Salaries'].mean()

36592.22104026846

In [80]:
df['Salaries'].fillna(df['Salaries'].mean(),inplace = True)

In [81]:
df['Salaries'][148]

36592.22104026846

In [82]:
df['Salaries'].isna().sum()

0

In [83]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                9
dtype: int64

### Race

In [84]:
df['Race'].isna().sum()

9

In [85]:
df[df['Race'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
22,"Fraval, Maruk",1411071302,Area Sales Manager,CT,6050.0,M,Single,US Citizen,Active,Sales,55990.40,34,NaN
67,"Gonzalez, Maria",1988299991,IT Support,MA,2472.0,F,Separated,US Citizen,Active,IT/IS,42389.40,28,NaN
107,"Fidelia, Libby",1006020020,Production Technician I,MA,2155.0,F,Married,US Citizen,Active,Production,43435.64,52,NaN
136,"Darson, Jene'ya",1001109612,Production Technician I,MA,2110.0,F,Married,US Citizen,Active,Production,45769.91,27,NaN
172,"Newman, Richard",1302053044,Production Technician I,MA,2136.0,M,Married,US Citizen,Leave of Absence,Production,33485.31,35,NaN
217,"Lynch, Lindsay",1001138521,Production Technician I,MA,1844.0,F,Single,US Citizen,Voluntarily Terminated,Production,26994.14,39,NaN
253,"Linden, Mathew",1405067565,Production Technician II,MA,1770.0,M,Married,US Citizen,Leave of Absence,Production,51727.02,41,NaN
285,"Navathe, Kurt",1009919960,Senior BI Developer,MA,2056.0,M,Single,US Citizen,Active,IT/IS,86859.00,35,NaN

In [86]:
df['Race'].fillna(method='bfill',inplace = True)

In [87]:
df['Race'].isna().sum()

0

In [88]:
df['Race'][172]

'White'

In [89]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

### B) Create pivot table for  position and average salary.

In [91]:
df.pivot_table(values = 'Salaries',index = 'Position',aggfunc = 'mean')

                                  Salaries
Position
Accountant I                    674.280000
Administrative Assistant      43362.530347
Area Sales Manager            41846.199668
BI Developer                  37235.387760
BI Director                    4160.000000
CIO                           26418.010000
Data Analyst                  37772.945714
Data Analyst                  42304.750000
Data Architect                90016.010000
Data Scientist                34387.906667
Database Administrator        33813.996000
Director of Operations        36592.221040
Director of Sales             27595.700000
Enterprise Architect           5802.000000
IT Director                   36741.000000
IT Manager - DB               49791.240000
IT Manager - Infra             8997.890000
IT Manager - Support           2143.580000
IT Support                    47139.906380
Network Engineer              35897.950000
President & CEO               52633.500000
Principal Data Architect      24828.700000
Production Manager            50443.086503
Production Technician I       35202.019596
Production Technician II      33803.863333
Sales Manager                 34093.246667
Senior BI Developer           71293.676667
Shared Services Manager       45262.975000
Software Engineer             39892.308889
Software Engineering Manager  40208.000000
Sr. Accountant                27349.755000
Sr. DBA                       31954.975000
Sr. Network Engineer          28438.600000

### C) Group the data using group by as per gender  and average age.

In [93]:
df.groupby(by = 'Gender')['age'].mean()

Gender
F     38.659091
M     38.746269
Name: age, dtype: float64